In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plot

In [2]:
df=pd.read_csv("F:/GDP.csv") # to load data

In [3]:
df

,Country,Country Code,1990,1991,1992,1993,1994,1995,1996,1997,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Aruba,ABW,24101.109430,25870.755940,26533.343900,27430.752400,28656.520210,28648.990020,28499.089430,30215.949230,...,33732.847450,35492.618490,35498.982090,37419.892820,38223.372260,38249.054870,38390.271650,39454.629830,NaN,NaN
1,Afghanistan,AFG,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1637.377987,1626.764793,1806.763930,1874.765634,1897.525938,1886.692977,1896.992520,1934.636754,1955.006208,NaN
2,Angola,AGO,3089.683369,3120.356148,2908.160798,2190.768160,2195.532289,2496.199493,2794.896906,2953.342709,...,6230.297028,6346.395122,6772.528333,6980.423038,7199.245478,7096.600615,6756.935074,6650.584940,6452.355165,NaN
3,Albania,ALB,2549.473022,1909.114038,1823.307673,2057.449657,2289.873135,2665.764906,2980.066288,2717.362124,...,9628.025783,10207.752350,10526.235450,10571.010650,11259.225890,11662.030480,11868.178970,12930.140030,13364.155400,NaN
4,Arab World,ARB,6808.206995,6872.273195,7255.328362,7458.647059,7645.682856,7774.207360,8094.149842,8397.515692,...,14127.778020,14518.827450,15423.465390,15824.780110,16153.244860,16501.792590,16935.383300,17099.889390,17570.137600,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
255,Kosovo,XKX,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,7782.875107,8222.285712,8547.652384,8903.763429,9194.741819,9781.019679,10208.857900,10756.663460,11348.363450,NaN
256,"Yemen, Rep.",YEM,2223.028771,2325.263661,2443.920401,2472.188808,2569.648739,2657.813447,2730.145147,2829.866193,...,4472.726448,3876.302619,3935.167105,4084.882967,4045.500031,3320.110156,2827.691023,2645.308383,2575.126385,NaN
257,South Africa,ZAF,6424.502215,6414.057923,6261.716184,6331.777580,6520.866604,6719.583315,7000.801619,7179.806651,...,11728.160490,12179.174190,12488.215570,12815.727070,13090.476830,13185.253280,13188.029620,13438.282890,13686.882360,NaN
258,Zambia,ZMB,1517.926292,1528.781247,1499.340446,1600.347799,1457.627696,1493.123972,1572.973238,1616.492883,...,3269.794329,3419.010460,3634.780353,3765.584162,3893.549478,3927.761816,3998.004435,4090.120040,4223.906936,NaN
259,Zimbabwe,ZWE,1829.677575,1949.732966,1777.843425,1807.225700,1986.028160,2004.362417,2227.060619,2303.829588,...,1888.566739,2168.110293,2534.541919,2583.985638,2648.568967,2679.580317,2687.385429,2825.725122,3029.793005,NaN

In [4]:
print(df.head()) # to know colulmns of the file with first five rows

      Country  Country Code          1990          1991          1992  \
0        Aruba          ABW  24101.109430  25870.755940  26533.343900
1  Afghanistan          AFG           NaN           NaN           NaN
2       Angola          AGO   3089.683369   3120.356148   2908.160798
3      Albania          ALB   2549.473022   1909.114038   1823.307673
4   Arab World          ARB   6808.206995   6872.273195   7255.328362

           1993          1994          1995          1996          1997  ...  \
0  27430.752400  28656.520210  28648.990020  28499.089430  30215.949230  ...
1           NaN           NaN           NaN           NaN           NaN  ...
2   2190.768160   2195.532289   2496.199493   2794.896906   2953.342709  ...
3   2057.449657   2289.873135   2665.764906   2980.066288   2717.362124  ...
4   7458.647059   7645.682856   7774.207360   8094.149842   8397.515692  ...

           2010          2011          2012          2013          2014  \
0  33732.847450  35492.618490  35498.982090  37419.892820  38223.372260
1   1637.377987   1626.764793   1806.763930   1874.765634   1897.525938
2   6230.297028   6346.395122   6772.528333   6980.423038   7199.245478
3   9628.025783  10207.752350  10526.235450  10571.010650  11259.225890
4  14127.778020  14518.827450  15423.465390  15824.780110  16153.244860

           2015          2016          2017          2018  2019
0  38249.054870  38390.271650  39454.629830           NaN   NaN
1   1886.692977   1896.992520   1934.636754   1955.006208   NaN
2   7096.600615   6756.935074   6650.584940   6452.355165   NaN
3  11662.030480  11868.178970  12930.140030  13364.155400   NaN
4  16501.792590  16935.383300  17099.889390  17570.137600   NaN

[5 rows x 32 columns]

In [5]:
print(df.shape) #print roaws and columns

(260, 32)

In [6]:
print(df.columns) # print columns names

Index(['Country ', 'Country Code', '1990', '1991', '1992', '1993', '1994',
       '1995', '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003',
       '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012',
       '2013', '2014', '2015', '2016', '2017', '2018', '2019'],
      dtype='object')

In [7]:
print(df.dtypes) #print data types of columns

Country          object
Country Code     object
1990            float64
1991            float64
1992            float64
1993            float64
1994            float64
1995            float64
1996            float64
1997            float64
1998            float64
1999            float64
2000            float64
2001            float64
2002            float64
2003            float64
2004            float64
2005            float64
2006            float64
2007            float64
2008            float64
2009            float64
2010            float64
2011            float64
2012            float64
2013            float64
2014            float64
2015            float64
2016            float64
2017            float64
2018            float64
2019            float64
dtype: object

In [8]:
print(df.info()) # to know more information about data in the column

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 260 entries, 0 to 259
Data columns (total 32 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country       260 non-null    object
 1   Country Code  260 non-null    object
 2   1990          209 non-null    float64
 3   1991          211 non-null    float64
 4   1992          213 non-null    float64
 5   1993          215 non-null    float64
 6   1994          218 non-null    float64
 7   1995          224 non-null    float64
 8   1996          224 non-null    float64
 9   1997          225 non-null    float64
 10  1998          226 non-null    float64
 11  1999          227 non-null    float64
 12  2000          236 non-null    float64
 13  2001          237 non-null    float64
 14  2002          238 non-null    float64
 15  2003          238 non-null    float64
 16  2004          238 non-null    float64
 17  2005          238 non-null    float64
 18  2006          238 non-null    float64
 19  2007          239 non-null    float64
 20  2008          240 non-null    float64
 21  2009          241 non-null    float64
 22  2010          241 non-null    float64
 23  2011          243 non-null    float64
 24  2012          241 non-null    float64
 25  2013          241 non-null    float64
 26  2014          240 non-null    float64
 27  2015          238 non-null    float64
 28  2016          238 non-null    float64
 29  2017          238 non-null    float64
 30  2018          231 non-null    float64
 31  2019          0 non-null      float64
dtypes: float64(30), object(2)
memory usage: 65.1+ KB
None

In [9]:
gdp1991_df = df['1991'] # to store column of the dataset

In [10]:
print(gdp1991_df.head()) # to print first five observations of column

0    25870.755940
1             NaN
2     3120.356148
3     1909.114038
4     6872.273195
Name: 1991, dtype: float64

In [11]:
print(gdp1991_df.tail()) # to print last five observations of column

255            NaN
256    2325.263661
257    6414.057923
258    1528.781247
259    1949.732966
Name: 1991, dtype: float64

In [12]:

subset=df[['Country ','Country Code','2018']] # to make subset of few columns
print(subset.head())

      Country  Country Code          2018
0        Aruba          ABW           NaN
1  Afghanistan          AFG   1955.006208
2       Angola          AGO   6452.355165
3      Albania          ALB  13364.155400
4   Arab World          ARB  17570.137600

In [13]:
print(subset.tail())  # last five rows of the subset

         Country  Country Code          2018
255        Kosovo          XKX  11348.363450
256   Yemen, Rep.          YEM   2575.126385
257  South Africa          ZAF  13686.882360
258        Zambia          ZMB   4223.906936
259      Zimbabwe          ZWE   3029.793005

In [14]:
print(subset.loc[1])  # print o row of the subset

Country         Afghanistan
Country Code            AFG
2018            1955.006208
Name: 1, dtype: object

In [15]:
print(subset.tail(n=1))   # to get the last row

     Country  Country Code         2018
259  Zimbabwe          ZWE  3029.793005

In [16]:
print(subset.loc[[0,100,155]])  # to select 0 100th and 155th row of the subset

                                              Country  Country Code  \
0                                                Aruba          ABW
100                                          Indonesia          IDN
155  Middle East & North Africa (excluding high inc...          MNA

           2018
0           NaN
100  13079.6193
155         NaN

In [17]:
print(subset.iloc[1])

Country         Afghanistan
Country Code            AFG
2018            1955.006208
Name: 1, dtype: object

In [18]:
subnet=df.loc[:,['Country Code','2011']]

In [19]:
print(subnet.head())

  Country Code          2011
0          ABW  35492.618490
1          AFG   1626.764793
2          AGO   6346.395122
3          ALB  10207.752350
4          ARB  14518.827450

In [20]:
print(subnet.tail())

    Country Code          2011
255          XKX   8222.285712
256          YEM   3876.302619
257          ZAF  12179.174190
258          ZMB   3419.010460
259          ZWE   2168.110293

In [21]:
sub=df.iloc[:,[1,-2]]  # iloc allows use to integers to access columns  ** negative means from last row
print(sub.head())

  Country Code          2018
0          ABW           NaN
1          AFG   1955.006208
2          AGO   6452.355165
3          ALB  13364.155400
4          ARB  17570.137600

In [22]:
s_range=list(range(5))

In [23]:
print(s_range)

[0, 1, 2, 3, 4]

In [24]:
sub1=df.iloc[:,s_range]  #subset the dataframe with range
print(sub1.head())

      Country  Country Code          1990          1991          1992
0        Aruba          ABW  24101.109430  25870.755940  26533.343900
1  Afghanistan          AFG           NaN           NaN           NaN
2       Angola          AGO   3089.683369   3120.356148   2908.160798
3      Albania          ALB   2549.473022   1909.114038   1823.307673
4   Arab World          ARB   6808.206995   6872.273195   7255.328362

In [25]:
print(df.loc[5, 'Country '])  #subsetting rows and columns using loc

United Arab Emirates

In [26]:
print(df.iloc[5,0])  # subsetting rows and columns using iloc

United Arab Emirates

In [27]:
print(df.iloc[[1,5,10],[0,1,15]])       #subsetting multiiple rows and columns using iloc of 1st,5th,10th row and 0th,1st,15th column

                Country  Country Code         2003
1            Afghanistan          AFG    888.15337
5   United Arab Emirates          ARE  82946.33521
10               Austria          AUT  32108.63255

In [28]:
print(df.loc[[1,5,10],['Country ','Country Code','2003']])  #using the above code by column name with loc

                Country  Country Code         2003
1            Afghanistan          AFG    888.15337
5   United Arab Emirates          ARE  82946.33521
10               Austria          AUT  32108.63255

In [29]:
print(df.loc[0:5,['Country ','Country Code','2003']])  #using the above code by column name with loc within range 0:5

               Country  Country Code          2003
0                 Aruba          ABW  31387.282960
1           Afghanistan          AFG    888.153370
2                Angola          AGO   3614.607278
3               Albania          ALB   4994.518807
4            Arab World          ARB   9974.641898
5  United Arab Emirates          ARE  82946.335210